
         Dcl-Pr DayOfWeek ZONED(1) ;
           WorkDate  Date;
         End-Pr;

         Dcl-Pr DayName Char(9);
           DateIn zoned(1);
         End-Pr;

                            