000100190329     A          R SHIFTT                  PFILE(SENECAPAY/ALLSHIFT)                                 
000101190329     A          K EMPNUM                                                                            
000102190329                                                                                                    
